RentService/SoapAdapter/src/main/resources/getAllEvents.xml

<?xml version="1.0" encoding="UTF-8"?><S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Header/>
    <S:Body xmlns:ns2="http://api.soap.rent_service.tks.pl/">
        <ns2:getAllEvents/>
    </S:Body>
</S:Envelope>